<a href="https://colab.research.google.com/github/maheshvmv/python/blob/master/pandas_prct.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas **

In [0]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=4)

In [67]:
import pandas as pd

draft1 = pd.read_csv('/content/panda.csv')
draft1.head(2)

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [70]:
draft2 = pd.read_table('/content/panda.csv',sep=',')
draft2.head(10)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [75]:

draft1 = pd.read_csv('/content/panda.csv', header=None)
draft1.head(10)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [0]:
draft1 = pd.read_csv('/content/panda.csv', names=['a1','a2','a3','a4'])

In [100]:
draft1

   a1  a2  a3       a4
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [79]:
type(draft1)

pandas.core.frame.DataFrame

In [80]:
!cat '/content/panda.csv'

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [97]:
url = 'http://www.espncricinfo.com/rankings/content/page/211271.html'

cr_data = pd.read_html(url)

cr_data

[    Pos          Team  Matches  Points  Rating
 0     1         India       39    4659     119
 1     2   New Zealand       26    2829     109
 2     3       England       42    4366     104
 3     4  South Africa       31    3177     102
 4     5     Australia       33    3270      99
 5     6     Sri Lanka       40    3795      95
 6     7      Pakistan       27    2263      84
 7     8   West Indies       32    2570      80
 8     9    Bangladesh       23    1413      61
 9    10   Afghanistan        3     165      55
 10   11      Zimbabwe        9     140      16
 11   12       Ireland        3       0       0,
     Pos          Team  Matches  Points  Rating
 0     1       England       54    6745     125
 1     2         India       58    7071     122
 2     3   New Zealand       42    4709     112
 3     4     Australia       50    5543     111
 4     5  South Africa       47    5193     110
 5     6      Pakistan       51    5019      98
 6     7    Bangladesh       46    3963      86
 7     8     Sri Lanka       56    4520      81
 8     9   West Indies       48    3675      77
 9    10   Afghanistan       40    2359      59
 10   11       Ireland       29    1466      51
 11   12      Zimbabwe       35    1538      44
 12   13   Netherlands        6     222      37
 13   14      Scotland       15     534      36
 14   15       Namibia        8     183      23
 15   16          Oman        8     174      22
 16   17         Nepal        8     152      19
 17   18           USA        8     115      14
 18   19           UAE       15     144      10
 19   20           PNG       17       0       0,
     Pos          Team  Matches  Points  Rating
 0     1      Pakistan       29    7935     274
 1     2       England       16    4253     266
 2     3  South Africa       18    4720     262
 3     4     Australia       22    5762     262
 4     5         India       33    8620     261
 ..  ...           ...      ...     ...     ...
 81   82        Gambia        6       0       0
 82   83     Gibraltar       12       0       0
 83   84     Swaziland        6       0       0
 84   85        Rwanda        6       0       0
 85   86       Lesotho        6       0       0

 [86 rows x 5 columns],
    Pos                Team  Matches  Points  Rating
 0    1     Australia Women       25    3784     151
 1    2         India Women       27    3441     127
 2    3       England Women       27    3303     122
 3    4   New Zealand Women       23    2533     110
 4    5  South Africa Women       33    3154      96
 5    6   West Indies Women       21    1664      79
 6    7      Pakistan Women       21    1613      77
 7    8     Sri Lanka Women       21    1163      55
 8    9    Bangladesh Women        8     387      48
 9   10       Ireland Women        6     110      18,
     Pos                Team  Matches  Points  Rating
 0     1     Australia Women       25    7331     293
 1     2       England Women       22    6141     279
 2     3   New Zealand Women       18    4963     276
 3     4   West Indies Women       22    5682     258
 4     5         India Women       28    7046     252
 5     6  South Africa Women       24    5776     241
 6     7      Pakistan Women       28    6423     229
 7     8     Sri Lanka Women       22    4420     201
 8     9    Bangladesh Women       27    5233     194
 9    10       Ireland Women       22    3622     165
 10   11      Thailand Women       41    6582     161
 11   12      Zimbabwe Women       20    3153     158
 12   13      Scotland Women       19    2759     145
 13   14         Nepal Women       17    2181     128
 14   15           PNG Women       23    2894     126
 15   16           UAE Women       19    2326     122
 16   17        Uganda Women       25    3036     121
 17   18         Samoa Women       15    1816     121
 18   19      Tanzania Women       19    1915     101
 19   20         Kenya Women       11    1053      96
 20   21   Netherlands Women       19    1640      86
 21   22     Indonesia Women       18    1448      80
 22   23     Hong Kong Women       25    1841      74
 23   24       Namibia Women       30    2103      70
 24   25         China Women       23    1554      68
 25   26         Japan Women       14     751      54
 26   27       Vanuatu Women       15     734      49
 27   28      Malaysia Women       27    1183      44
 28   29        Rwanda Women       20     851      43
 29   30       Myanmar Women       10     424      42
 30   31     Argentina Women       14     584      42
 31   32           USA Women        9     371      41
 32   33        Jersey Women        7     280      40
 33   34        Brazil Women       16     624      39
 34   35        Kuwait Women        8     309      39
 35   36  Sierra Leone Women        8     308      39
 36   37        France Women        9     333      37
 37   38      Botswana Women       10     368      37
 38   39       Germany Women        7     234      33
 39   40       Nigeria Women       16     478      30
 40   41       Denmark Women        3      85      28
 41   42   South Korea Women        9     159      18
 42   43        Bhutan Women        6     101      17
 43   44         Chile Women       10     121      12
 44   45        Malawi Women        3      34      11
 45   46    Mozambique Women        9      94      10
 46   47        Mexico Women        8      83      10
 47   48       Austria Women        6      54       9
 48   49       Belgium Women        3      20       7
 49   50     Singapore Women       10       6       1
 50   51          Peru Women        6      13       2
 51   52          Fiji Women       12       0       0
 52   53        Norway Women        6       0       0
 53   54          Mali Women        6       0       0
 54   55       Lesotho Women        3       0       0]

In [92]:
  cr_data[0].ix[:,0:20]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

    Pos          Team  Matches  Points  Rating
0     1         India       39    4659     119
1     2   New Zealand       26    2829     109
2     3       England       42    4366     104
3     4  South Africa       31    3177     102
4     5     Australia       33    3270      99
5     6     Sri Lanka       40    3795      95
6     7      Pakistan       27    2263      84
7     8   West Indies       32    2570      80
8     9    Bangladesh       23    1413      61
9    10   Afghanistan        3     165      55
10   11      Zimbabwe        9     140      16
11   12       Ireland        3       0       0

In [95]:
cr_data[["Team"]].head()

TypeError: ignored

In [101]:
draft1.dtypes()

TypeError: ignored

In [102]:
draft1

   a1  a2  a3       a4
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [0]:
draft1.to_json('/content/sample.csv')

In [0]:
draft1.to_csv('/content/sample.csv', index = False, header=False)

In [0]:
import sqlite3

db = sqlite3.connect("my_db1.db")
db.execute("drop table if exists test")
query="""
CREATE TABLE test  (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);"""
con = sqlite3.connect('mydata2.sqlite')

In [128]:
con.execute(query)

OperationalError: ignored

In [129]:
con.commit

In [0]:
data = [('Atlanta', 'Georgia', 1.25, 6)]
stmt = "INSERT INTO test VALUES (?, ?, ?, ?)"
con.executemany(stmt,data)
con.commit()

In [143]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6), ('Atlanta', 'Georgia', 1.25, 6)]

In [140]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [136]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

         a        b     c  d
0  Atlanta  Georgia  1.25  6

In [144]:
#results = db.execute("select * from test")
for row in rows:
  print(row)

('Atlanta', 'Georgia', 1.25, 6)
('Atlanta', 'Georgia', 1.25, 6)